import { toTokenList } from '../src/api';

test.each([
    ["", []],
    ["α", ["α"]],
    ["δ'", ["δ'"]],
    ["ὁ ἄνθρώπός τις", ["ὁ", "ἄνθρώπός", "τις"]],
    [
        `Πάντες ἄνθρωποι τοῦ εἰδέναι ὀρέγονται φύσει. σημεῖον δ'
ἡ τῶν αἰσθήσεων ἀγάπησις· καὶ γὰρ χωρὶς τῆς χρείας
ἀγαπῶνται δι' αὑτάς, καὶ μάλιστα τῶν ἄλλων ἡ διὰ τῶν
ὀμμάτων. οὐ γὰρ μόνον ἵνα πράττωμεν ἀλλὰ καὶ μηθὲν
μέλλοντες πράττειν τὸ ὁρᾶν αἱρούμεθα ἀντὶ πάντων ὡς εἰπεῖν
τῶν ἄλλων.`,
        [
            "Πάντες", "ἄνθρωποι", "τοῦ", "εἰδέναι", "ὀρέγονται", "φύσει", ".", "σημεῖον", "δ'",
            "ἡ", "τῶν", "αἰσθήσεων", "ἀγάπησις", "·", "καὶ", "γὰρ", "χωρὶς", "τῆς", "χρείας",
            "ἀγαπῶνται", "δι'", "αὑτάς", ",", "καὶ", "μάλιστα", "τῶν", "ἄλλων", "ἡ", "διὰ", "τῶν",
            "ὀμμάτων", ".", "οὐ", "γὰρ", "μόνον", "ἵνα", "πράττωμεν", "ἀλλὰ", "καὶ", "μηθὲν",
            "μέλλοντες", "πράττειν", "τὸ", "ὁρᾶν", "αἱρούμεθα", "ἀντὶ", "πάντων", "ὡς", "εἰπεῖν",
            "τῶν", "ἄλλων", ".",
        ]
    ],
    [
        `τὸ δ' ὅτι πᾶσι τοῖς τοιοῖσδε κατ' εἶδος ἓν ἀφορισθεῖσι,
κάμνουσι τηνδὶ τὴν νόσον, συνήνεγκεν, [ οἷον τοῖς φλεγματώδεσιν
ἢ χολώδεσι [ἢ] πυρέττουσι καύσῳ], τέχνης.-πρὸς μὲν
οὖν τὸ πράττειν ἐμπειρία τέχνης οὐδὲς δοκεῖ διαφέρειν,`,
        [
            "τὸ", "δ'", "ὅτι", "πᾶσι", "τοῖς", "τοιοῖσδε", "κατ'", "εἶδος", "ἓν", "ἀφορισθεῖσι", ",",
            "κάμνουσι", "τηνδὶ", "τὴν", "νόσον", ",", "συνήνεγκεν", ",", "[", "οἷον", "τοῖς", "φλεγματώδεσιν",
            "ἢ", "χολώδεσι", "[", "ἢ", "]", "πυρέττουσι", "καύσῳ", "]", ",", "τέχνης", ".", "-", "πρὸς", "μὲν",
            "οὖν", "τὸ", "πράττειν", "ἐμπειρία", "τέχνης", "οὐδὲς", "δοκεῖ", "διαφέρειν", ",",
        ]
    ],
])("from %s to %s", (text, words) => {
    expect(toTokenList(text)).toStrictEqual(words);
});
